import Image from "next/image";
import React from "react";

const Archive = () => {
    return (
        <div className="w-full px-[30px] pt-[10px] max-md:p-[10px] flex flex-col overflow-hidden gap-y-[150px] bg-center bg-[url(/images/bio/archieve_bg.png)] py-[150px] bg-cover">
            {/*1*/}
            <div className="w-full h-full flex justify-between gap-[150px]">
                <div className="w-[50%] flex items-end flex-col space-y-[50px]">
                    <div className="flex gap-2 items-end">
                        <p className="text-accent font-black">часть 6.</p>
                        <p className="text-5xl">архив</p>
                    </div>
                    <div className="w-[500px] space-y-[20px]">
                        <p>
                            «Есть два вида литературы: горизонтальная и
                            вертикальная, — говорил Рыжий. — Горизонтальная —
                            это западная. Они пишут много, просто текст,
                            полотно, в нем есть хорошие места, есть плохие.
                            А есть вертикальная литература — это наша, русская,
                            мы пишем, потом что-то вымарываем, что-то оставляем.
                            И вот как раз мастерство — поэтом, “писакой” быть
                            очень просто, а мастером стать очень сложно —
                            мастерство заключается в том, чтобы из того, что
                            ты сделал, оставить нужное или дописать что-то,
                            но при этом не тронуть девственность этого
                            вдохновения. Это самое главное».
                        </p>
                        <p>
                            Он был мастером. «Только кажется, что у него простые
                            стихи, на самом деле это сложная, высокопробная
                            поэзия, — объясняет Дозморов. — Он понятен всем:
                            искушенному в стихах человеку и человеку, который
                            в стихах не разбирается. Эта универсальность —
                            уникальное свойство. Такое, возможно, было у Есенина
                            и Высоцкого. Люди искренне считали, что Высоцкий
                            воевал, сидел, лазал по горам. У Бориса тот же
                            талант Протея, уникальный талант».
                        </p>
                    </div>
                </div>
                <div className="w-[50%] min-h-full flex gap-y-[50px] flex-col text-lg"></div>
            </div>
            {/* 2 */}
            <div className="w-full h-full flex justify-center">
                <div className="w-[1150px] h-[700px] relative">
                    <Image
                        src={"/images/bio/bio15.png"}
                        alt="bio1"
                        sizes="auto"
                        className="object-cover aspect-video"
                        fill={true}
                    />
                </div>
            </div>
            {/* 3 */}
            <div className="w-full h-full flex justify-between gap-[150px]">
                <div className="w-[50%] min-h-full flex gap-y-[50px] flex-col text-lg"></div>
                <div className="w-[50%] flex-col space-y-[50px]">
                    <div className="w-[500px] space-y-[50px]">
                        <div className="space-y-[20px]">
                            <p className="font-black">
                                Вадим Курочкин, близкий университетский друг
                                Бориса, стоит на метеогорке и смотрит
                                на Екатеринбург.
                            </p>
                            <p>
                                До строительства небоскреба «Высоцкий»
                                метеогорка была самой высокой точкой города.
                                Отсюда видно, как хаотично меняется город
                                в последние годы: стеклянно-бетонные гиганты
                                втискиваются между хрущевками и историческими
                                постройками. Ощущение, что городу будто
                                пристроили несколько этажей.
                            </p>
                            <p>
                                Вдалеке слева — Вторчермет, за ним — Елизавет,
                                еще один рабочий район. Курочкин жил как раз в
                                Елизавете, каждый день добирался до центра
                                города полтора часа.
                            </p>
                        </div>
                        <div className="w-[500px] h-[600px] relative">
                            <Image
                                src={"/images/bio/bio16.png"}
                                alt="bio1"
                                sizes="auto"
                                className="object-cover aspect-video"
                                fill={true}
                            />
                        </div>
                        <div className="space-y-[20px]">
                            <p>
                                Вадим дружил с Борисом не «по части поэзии».
                                Он ни разу не читал «Роттердамский дневник»
                                Рыжего, и я читаю ему отрывки — описание
                                их студенческих «приключений». «Я начинаю
                                вспоминать этого Махача, жену его, — оживляется
                                Курочкин. — Дискотеку эту помню. Боря мне еще
                                сказал: танцуем спина к спине, чтобы прикрывать
                                друг друга. Это его правило было, он же боксер…»
                            </p>
                            <p>
                                Вадим узнал о смерти Бориса из новостей
                                по радио, но даже не придал этому значения —
                                подумал, что это очередной розыгрыш Рыжего.
                                Он говорит, что таких друзей, как Боря, у него
                                никогда не было и больше не будет. «Каким бы
                                он был сейчас? Высокий, красивый, с усами. Да,
                                я бы попросил его отрастить. Интересно
                                посмотреть на Борю с усами: со шрамом видел,
                                а с усами — нет. Я шучу, конечно».
                            </p>
                            <p>
                                И он чуть ли не впервые за весь наш разговор
                                улыбается.
                            </p>
                        </div>
                    </div>
                </div>
            </div>
        </div>
    );
};

export default Archive;
