import Image from "next/image";
import React from "react";

const Poems = () => {
    return (
        <div className="w-full px-[30px] pt-[10px] max-md:p-[10px] flex flex-col overflow-hidden bg-center gap-y-[150px] bg-[url(/images/bio/poems_bg.png)] py-[150px] bg-cover">
            {/*1*/}
            <div className="w-full h-full flex justify-between gap-[150px]">
                <div className="w-[50%] flex items-end flex-col space-y-[50px]">
                    <div className="flex gap-2 items-end">
                        <p className="text-accent font-black">часть 5.</p>
                        <p className="text-5xl">стихи</p>
                    </div>
                    <div className="w-[500px] space-y-[20px]">
                        <p>
                            «Есть два вида литературы: горизонтальная и
                            вертикальная, — говорил Рыжий. — Горизонтальная —
                            это западная. Они пишут много, просто текст,
                            полотно, в нем есть хорошие места, есть плохие.
                            А есть вертикальная литература — это наша, русская,
                            мы пишем, потом что-то вымарываем, что-то оставляем.
                            И вот как раз мастерство — поэтом, “писакой” быть
                            очень просто, а мастером стать очень сложно —
                            мастерство заключается в том, чтобы из того, что
                            ты сделал, оставить нужное или дописать что-то,
                            но при этом не тронуть девственность этого
                            вдохновения. Это самое главное».
                        </p>
                    </div>
                    <div className="w-[500px] h-[400px] relative">
                        <Image
                            src={"/images/bio/bio12.png"}
                            alt="bio1"
                            sizes="auto"
                            className="object-cover aspect-video"
                            fill={true}
                        />
                    </div>
                    <div className="w-[500px] space-y-[20px]">
                        <p>
                            Он был мастером. «Только кажется, что у него простые
                            стихи, на самом деле это сложная, высокопробная
                            поэзия, — объясняет Дозморов. — Он понятен всем:
                            искушенному в стихах человеку и человеку, который
                            в стихах не разбирается. Эта универсальность —
                            уникальное свойство. Такое, возможно, было у Есенина
                            и Высоцкого. Люди искренне считали, что Высоцкий
                            воевал, сидел, лазал по горам. У Бориса тот же
                            талант Протея, уникальный талант».
                        </p>
                    </div>
                </div>
                <div className="w-[50%] min-h-full flex gap-y-[50px] flex-col text-lg"></div>
            </div>
            {/*2*/}
            <div className="w-full h-full flex justify-between gap-[150px]">
                <div className="w-[50%] flex justify-end items-start">
                    <div className="w-[500px] h-[600px] relative">
                        <Image
                            src={"/images/bio/bio13.png"}
                            alt="bio1"
                            sizes="auto"
                            className="object-cover aspect-video"
                            fill={true}
                        />
                    </div>
                </div>
                <div className="w-[50%] min-h-full flex gap-y-[50px] flex-col text-lg">
                    <div className="w-[500px] space-y-[20px]">
                        <p className="w-[500px]">
                            Александр Кушнер главным в поэзии Рыжего называет
                            сочетание высокой поэтической «музыки» с низкой
                            прозой жизни молодого человека девяностых годов в
                            Екатеринбурге. Евгений Рейн отмечал его раннюю
                            стихотворческую зрелость, доскональное знание
                            классической, модернистской, советской поэзии,
                            твердо продуманной и строго доказательной позиции в
                            литературной работе.
                        </p>
                        <p>
                            Рыжий начал писать стихи в школе, а с 1992 года его
                            уже стали публиковать. В то время о появлении нового
                            поэта можно было узнать только из литературных
                            журналов, и стихи Рыжего печатались в «Звезде»,
                            «Урале», альманахе Urbi. Настоящий успех пришел
                            после публикации в «Знамени» в 1999 году. За эту
                            подборку «фирменных» стихов Рыжему спустя почти год
                            вручили премию «Антибукер».
                        </p>
                        <p>
                            Борис узнал о премии из новостей телеканала
                            «Культура»: «Сообщалось, что премию в области поэзии
                            получил некто сорокалетний, скрывающийся под
                            псевдонимом Борис Рыжий и пишущий о новых русских
                            бандитах. Я чуть с дивана не упал. Потом стали
                            звонить мои тетушки и дядюшки из Израиля, из разных
                            городов России и спрашивать: “Что случилось с нашим
                            Боренькой? Как он докатился до такого?” А на самом
                            деле стихи были о любви — к женщине, к жизни. И о
                            смерти».
                        </p>
                        <p className="w-[500px]">
                            «Успех Бориса и для Москвы беспрецедентный, а для
                            Екатеринбурга — тем более: раз — и первый поэт
                            появился, — говорит Дозморов. — Боря доказал, что
                            можно жить не в столице и быть не провинциальным
                            поэтом».
                        </p>
                    </div>
                </div>
            </div>
            {/*3*/}
            <div className="w-full h-full flex justify-center">
                <div className="w-[1150px] h-[700px] relative">
                    <Image
                        src={"/images/bio/bio14.png"}
                        alt="bio1"
                        sizes="auto"
                        className="object-cover aspect-video"
                        fill={true}
                    />
                </div>
            </div>
            {/* 4 */}
            <div className="w-full h-full flex justify-between gap-[150px]">
                <div className="w-[50%] min-h-full flex gap-y-[50px] flex-col text-lg"></div>
                <div className="w-[50%] flex-col space-y-[50px]">
                    <div className="w-[500px] space-y-[20px]">
                        <p>
                            В одном из интервью Рыжий коснулся как раз этой
                            темы: «Я никогда не оценивал себя в масштабах
                            города. Я хотел писать лучше, чем Пастернак, я хотел
                            писать лучше, чем Бродский».
                        </p>
                        <p>
                            «Антибукеру», по словам близких, он был очень рад,
                            но благодаря премии у него добавилась еще одна
                            причина для переживаний: напишет ли он снова хорошие
                            стихи? Не раздают ли люди ему «авансы»?
                        </p>
                        <p>
                            В 2000-м вышла первая книга стихов Рыжего —
                            в «Пушкинском фонде». За пару лет до этого события
                            Борис с Ириной шли с «маститыми» поэтами
                            по Екатеринбургу, и Борис — ради красного словца,
                            да и чтобы щелкнуть их по носу — сказал, что его
                            стихи скоро выйдут в «Пушкинском фонде». Мечта
                            сбылась.
                        </p>
                    </div>
                </div>
            </div>
        </div>
    );
};

export default Poems;
