export const poems = [
    {
        id: 1,
        title: "В России расстаются навсегда",
        text: `В России расстаются навсегда.
  В России друг от друга города
  столь далеки,
  что вздрагиваю я, шепнув «прощай».
  Рукой своей касаюсь невзначай
  ее руки.

  Длиною в жизнь любая из дорог.
  Скажите, что такое русский Бог?
  «Конечно, я
  приеду». Не приеду никогда.
  В России расстаются навсегда.
  «Душа моя, приеду».

  Через сотни лет вернусь.
  Какая малость, милость, что за грусть —
  мы насовсем
  прощаемся. «Дай капельку сотру».
  Да, не приеду. Видимо, умру
  скорее, чем.

  В России расстаются навсегда.
  Еще один подкинь кусочек льда
  в холодный стих.
  …И поезда уходят под откос,
  …И самолёты, долетев до звёзд,
  сгорают в них.`,
        year: 1996,
        genres: ["О любви", "О жизни"],
        bg: "/images/poems/bg_1.jpg",
    },
    {
        id: 2,
        title: "Ничего не надо, даже счастья",
        text: `Ничего не надо, даже счастья
  быть любимым, не
  надо даже тёплого участья,
  яблони в окне.
  Ни печали женской, ни печали,
  горечи, стыда.
  Рожей — в грязь, и чтоб не поднимали
  больше никогда.
  Не вели бухого до кровати.
  Вот моя строка:
  без меня отчаливайте, хватит
  — небо, облака!
  Жалуйтесь, читайте и жалейте,
  греясь у огня,
  вслух читайте, смейтесь, слёзы лейте.
  Только без меня.
  Ничего действительно не надо,
  что ни назови:
  ни чужого яблоневого сада,
  ни чужой любви,
  что тебя поддерживает нежно,
  уронить боясь.
  Лучше страшно, лучше безнадежно,
  лучше рылом в грязь.`,
        genres: ["О жизни"],
        bg: "/images/poems/bg_2.jpg",
    },
    {
        id: 3,
        title: "Прежде чем на тракторе разбиться…",
        text: `Прежде чем на тракторе разбиться,
  застрелиться, утонуть в реке,
  приходил лесник опохмелиться,
  приносил мне вишни в кулаке.

  С рюмкой спирта мама выходила,
  менее красива, чем во сне.
  Снова уходила, вишню мыла
  и на блюдце приносила мне.

  Патронташ повесив в коридоре,
  привозил отец издалека
  с камышами синие озера,
  белые в озерах облака.

  Потому что все меня любили,
  дерева молчали до утра.
  «Девочке медведя подарили», –
  перед сном читала мне сестра.

  Мальчику полнеба подарили,
  сумрак елей, золото берез.
  На заре гагару подстрелили.
  И лесник три вишенки принес.

  Было много утреннего света,
  с крыши в руки падала вода,
  это было осенью, а лето
  я не вспоминаю никогда.`,
        year: 1999,
        genres: ["О детстве", "О жизни"],
        bg: "/images/poems/bg_3.jpg",
    },
    {
        id: 4,
        title: "Молодость мне много обещала…",
        text: `Молодость мне много обещала,
  было мне когда-то двадцать лет.
  Это было самое начало,
  я был глуп, и это не секрет.

  Это, — мне хотелось быть поэтом,
  но уже не очень, потому,
  что не заработаешь на этом
  и цветов не купишь никому.

  Вот и стал я горным инженером,
  получил с отличием диплом.
  Не ходить мне по осенним скверам,
  виршей не записывать в альбом.

  В голубом от дыма ресторане
  слушать голубого скрипача,
  денежки отсчитывать в кармане,
  развернув огромные плеча.

  Так не вышло из меня поэта,
  и уже не выйдет никогда.
  Господа, что скажете на это?
  Молча пьют и плачут господа.

  Пьют и плачут, девок обнимают,
  снова пьют и всё-таки молчат,
  головой тонически качают,
  матом силлабически кричат.`,
        year: 1997,
        genres: ["О жизни", "О поэзии", "О молодости"],
        bg: "/images/poems/bg_4.jpg",
    },
    {
        id: 5,
        title: "Над домами",
        text: `Над домами, домами, домами
голубые висят облака —
вот они и останутся с нами
на века, на века, на века.

Только пар, только белое в синем
над громадами каменных плит…
никогда никуда мы не сгинем,
Мы прочней и нежней, чем гранит.

Пусть разрушатся наши скорлупы,
геометрия жизни земной, —
оглянись, поцелуй меня в губы,
дай мне руку, останься со мной.

А когда мы друг друга покинем,
ты на крыльях своих унеси
только пар, только белое в синем,
голубое и белое в си…`,
        genres: ["О любви"],
        bg: "/images/poems/bg_5.jpg",
    },
    {
        id: 6,
        title: "Приобретут всеевропейский лоск…",
        text: `Приобретут всеевропейский лоск
Слова трансазиатского поэта,
Я позабуду сказочный Свердловск
И школьный двор в районе Вторчермета.

Но где бы мне ни выпало остыть,
В Париже знойном, Лондоне промозглом,
Мой жалкий прах советую зарыть
На безымянном кладбище свердловском.

Не в плане не лишенной красоты,
Но вычурной и артистичной позы,
А потому что там мои кенты,
Их профили на мраморе и розы.

На купоросных голубых снегах,
Закончившие ШРМ на тройки,
Они споткнулись с медью в черепах
Как первые солдаты перестройки.

Пусть Вторчермет гудит своей трубой,
Пластполимер пускай свистит протяжно.
А женщина, что не была со мной,
Альбом откроет и закурит важно.

Она откроет голубой альбом,
Где лица наши будущим согреты,
Где живы мы, в альбоме голубом,
Земная шваль: бандиты и поэты.`,
        year: 1998,
        genres: ["О жизни"],
        bg: "/images/poems/bg_6.jpg",
    },
    {
        id: 7,
        title: "Мне не хватает нежности в стихах",
        text: `Мне не хватает нежности в стихах,
а я хочу, чтоб получалась нежность —
как неизбежность или как небрежность.

И я тебя целую впопыхах.
О муза бестолковая моя!
Ты, отворачиваясь, прячешь слезы.
а я реву от этой жалкой прозы,
лица не пряча, сердца не тая.

Пацанка, я к щеке твоей прилип.
Как старики, как ангелы, как дети,
мы будем жить одни на целом свете.
Ты всхлипываешь, я рифмую «всхлип».`,
        year: 1999,
        genres: ["О музе", "О поэзии"],
        bg: "/images/poems/bg_7.jpg",
    },
];
